74th/test-esp32-arduino/20250810-morse_code_ip_address/src/main.cpp
#include <M5Unified.h>
#include <Adafruit_NeoPixel.h>
#include <ESP32SerialWiFiSetup.h>

Esp32SerialWifiSetup::WiFiSetupManager wifiSetup;
Adafruit_NeoPixel led(1, G27, NEO_GRB + NEO_KHZ800);

void setup()
{
  M5.begin();

  led.begin();

  // Initialize the WiFi setup manager
  wifiSetup.begin();

  Serial.println("ESP32 Serial WiFi Setup - JSON-RPC Interface");
  Serial.println("============================================");
  Serial.println("Send JSON-RPC commands to configure WiFi:");
  Serial.println();
  Serial.println("Set WiFi credentials:");
  Serial.println("{\"jsonrpc\": \"2.0\", \"method\": \"set_wifi_creds\", \"params\": {\"ssid\": \"your_ssid\", \"pass\": \"your_password\"}, \"id\":1}");
  Serial.println();
  Serial.println("Get WiFi credentials:");
  Serial.println("{\"jsonrpc\": \"2.0\", \"method\": \"get_wifi_creds\", \"id\":1}");
  Serial.println();
  Serial.println("Get IP address:");
  Serial.println("{\"jsonrpc\": \"2.0\", \"method\": \"get_ip\", \"id\":1}");
  Serial.println();
  Serial.println("Get MAC address:");
  Serial.println("{\"jsonrpc\": \"2.0\", \"method\": \"get_mac_address\", \"id\":1}");
  Serial.println();
}

// モールス信号のパターン定義（数字0-9）
// ドット=短点（150ms）、ダッシュ=長点（450ms）
const char *morse_digits[] = {
    "-----", // 0
    ".----", // 1
    "..---", // 2
    "...--", // 3
    "....-", // 4
    ".....", // 5
    "-....", // 6
    "--...", // 7
    "---..", // 8
    "----."  // 9
};

// モールス信号のタイミング設定
const unsigned long DOT_DURATION = 250;               // ドット（短点）の長さ
const unsigned long DASH_DURATION = DOT_DURATION * 3; // ダッシュ（長点）の長さ
const unsigned long SIGNAL_GAP = DOT_DURATION;        // 信号間の間隔
const unsigned long DIGIT_GAP = DASH_DURATION;        // 数字間の間隔

// モールス信号の状態管理
enum MorseState
{
  MORSE_IDLE,
  MORSE_ON,
  MORSE_SIGNAL_GAP,
  MORSE_DIGIT_GAP
};

static MorseState morse_state = MORSE_IDLE;
static unsigned long morse_start_time = 0;
static uint8_t current_digit_index = 0;
static uint8_t current_signal_index = 0;
static bool morse_active = false;
static bool signal_started = false; // 各信号の開始フラグ

uint8_t local_ip = {0};
uint8_t ip_text[32] = {0};
uint8_t ip_text_len = 0;
void morse_code_ip_address_init(unsigned long now_ms)
{
  uint32_t ip_u32 = uint32_t(WiFi.localIP());
  local_ip = (ip_u32 >> 24) & 0xFF;

  if (local_ip >= 100)
  {
    ip_text[0] = '1';
    ip_text[1] = '0' + (local_ip / 10) % 10;
    ip_text[2] = '0' + local_ip % 10;
    ip_text_len = 3;
  }
  else if (local_ip >= 10)
  {
    ip_text[0] = '0' + (local_ip / 10) % 10;
    ip_text[1] = '0' + local_ip % 10;
    ip_text_len = 2;
  }
  else
  {
    ip_text[0] = '0' + local_ip;
    ip_text_len = 1;
  }

  // モールス信号の開始
  morse_active = true;
  morse_state = MORSE_IDLE;
  current_digit_index = 0;
  current_signal_index = 0;
  morse_start_time = now_ms;

  Serial.print("[MORSE] モールス信号開始 - IPアドレス最後のバイト: ");
  Serial.print(local_ip);
  Serial.print(" (文字列: ");
  for (int i = 0; i < ip_text_len; i++)
  {
    Serial.print((char)ip_text[i]);
  }
  Serial.println(")");

  // モールス信号パターンの詳細表示
  Serial.println("[MORSE] 送信予定パターン:");
  for (int i = 0; i < ip_text_len; i++)
  {
    char digit = ip_text[i];
    Serial.printf("  数字 '%c' -> %s\r\n", digit, morse_digits[digit - '0']);
  }
}

void led_on()
{
  led.setPixelColor(0, led.Color(255, 255, 255));
  led.show();
}

void led_off()
{
  led.setPixelColor(0, led.Color(0, 0, 0));
  led.show();
}

void morse_code_ip_address_loop(unsigned long now_ms)
{
  if (!morse_active)
  {
    return;
  }

  unsigned long elapsed = now_ms - morse_start_time;

  switch (morse_state)
  {
  case MORSE_IDLE:
    // 新しい数字の開始
    if (current_digit_index < ip_text_len)
    {
      char digit = ip_text[current_digit_index];
      if (digit >= '0' && digit <= '9')
      {
        current_signal_index = 0;
        morse_state = MORSE_ON;
        morse_start_time = now_ms;
        signal_started = false; // 新しい数字の開始時にリセット
        Serial.printf("[MORSE] 数字 '%c' の送信開始 (パターン: %s)\r\n",
                      digit, morse_digits[digit - '0']);

        // 最初の信号を即座に開始
        char signal = morse_digits[digit - '0'][0];
        led_on();
        Serial.printf("[MORSE] 信号 '%c' (%s) 点灯開始 (%dms)\r\n",
                      signal,
                      (signal == '.') ? "ドット" : "ダッシュ",
                      (int)((signal == '.') ? DOT_DURATION : DASH_DURATION));
        signal_started = true;
      }
    }
    else
    {
      // 全ての数字を送信完了、停止
      morse_active = false;
      led_off();
      Serial.printf("[MORSE] 全数字送信完了、モールス信号終了\r\n");
    }
    break;

  case MORSE_ON:
  {
    char digit = ip_text[current_digit_index];
    int digit_num = digit - '0';
    const char *pattern = morse_digits[digit_num];

    if (current_signal_index < strlen(pattern))
    {
      char signal = pattern[current_signal_index];
      unsigned long duration = (signal == '.') ? DOT_DURATION : DASH_DURATION;

      // 信号開始時の処理は既に状態遷移時に実行済み
      // ここでは時間経過のみチェック
      if (elapsed >= duration)
      {
        led_off();
        morse_state = MORSE_SIGNAL_GAP;
        morse_start_time = now_ms;
        current_signal_index++;
        signal_started = false; // 次の信号のためにリセット
        Serial.printf("[MORSE] 信号 '%c' 完了、信号間隔 (%dms)\r\n",
                      signal, (int)SIGNAL_GAP);
      }
    }
  }
  break;

  case MORSE_SIGNAL_GAP:
    if (elapsed >= SIGNAL_GAP)
    {
      char digit = ip_text[current_digit_index];
      int digit_num = digit - '0';
      const char *pattern = morse_digits[digit_num];

      if (current_signal_index < strlen(pattern))
      {
        // 同じ数字の次の信号
        morse_state = MORSE_ON;
        morse_start_time = now_ms;
        signal_started = false; // 次の信号開始前にリセット

        // 次の信号を即座に開始
        char signal = pattern[current_signal_index];
        led_on();
        Serial.printf("[MORSE] 信号 '%c' (%s) 点灯開始 (%dms)\r\n",
                      signal,
                      (signal == '.') ? "ドット" : "ダッシュ",
                      (int)((signal == '.') ? DOT_DURATION : DASH_DURATION));
        signal_started = true;
      }
      else
      {
        // この数字の送信完了、次の数字へ
        current_digit_index++;
        morse_state = MORSE_DIGIT_GAP;
        morse_start_time = now_ms;
        Serial.printf("[MORSE] 数字 '%c' 送信完了、数字間隔 (%dms)\r\n",
                      digit, (int)DIGIT_GAP);
      }
    }
    break;

  case MORSE_DIGIT_GAP:
    if (elapsed >= DIGIT_GAP)
    {
      morse_state = MORSE_IDLE;
      morse_start_time = now_ms;
    }
    break;
  }
}

uint32_t last_led_time = 0;

void loop()
{
  M5.delay(1);
  M5.update();
  unsigned long now = millis();

  if (M5.BtnA.wasReleased())
  {
    if (morse_active)
    {
      // モールス信号停止
      morse_active = false;
      led_off();
      Serial.println("[MORSE] モールス信号停止");
    }
    else
    {
      // モールス信号開始
      Serial.println("[MORSE] ボタン押下 - モールス信号開始準備");
      morse_code_ip_address_init(now);
    }
  }
  morse_code_ip_address_loop(now);

  // Handle JSON-RPC commands from serial port
  wifiSetup.handleSerialCommands();

  // Optional: Print connection status every 30 seconds
  static unsigned long lastStatusPrint = 0;
  if (now - lastStatusPrint > 30000)
  {
    lastStatusPrint = millis();

    if (wifiSetup.isConnected())
    {
      Serial.print("Status: Connected to WiFi - IP: ");
      Serial.println(wifiSetup.getIPAddress());
    }
    else
    {
      Serial.println("Status: Not connected to WiFi");
    }
  }
}